bluekitchen/btstack/port/renesas-ek-ra6m4a-da14531/e2-project/ra/fsp/src/r_flash_hp/r_flash_hp.c
/***********************************************************************************************************************
 * Copyright [2020-2022] Renesas Electronics Corporation and/or its affiliates.  All Rights Reserved.
 *
 * This software and documentation are supplied by Renesas Electronics America Inc. and may only be used with products
 * of Renesas Electronics Corp. and its affiliates ("Renesas").  No other uses are authorized.  Renesas products are
 * sold pursuant to Renesas terms and conditions of sale.  Purchasers are solely responsible for the selection and use
 * of Renesas products and Renesas assumes no liability.  No license, express or implied, to any intellectual property
 * right is granted by Renesas. This software is protected under all applicable laws, including copyright laws. Renesas
 * reserves the right to change or discontinue this software and/or this documentation. THE SOFTWARE AND DOCUMENTATION
 * IS DELIVERED TO YOU "AS IS," AND RENESAS MAKES NO REPRESENTATIONS OR WARRANTIES, AND TO THE FULLEST EXTENT
 * PERMISSIBLE UNDER APPLICABLE LAW, DISCLAIMS ALL WARRANTIES, WHETHER EXPLICITLY OR IMPLICITLY, INCLUDING WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NONINFRINGEMENT, WITH RESPECT TO THE SOFTWARE OR
 * DOCUMENTATION.  RENESAS SHALL HAVE NO LIABILITY ARISING OUT OF ANY SECURITY VULNERABILITY OR BREACH.  TO THE MAXIMUM
 * EXTENT PERMITTED BY LAW, IN NO EVENT WILL RENESAS BE LIABLE TO YOU IN CONNECTION WITH THE SOFTWARE OR DOCUMENTATION
 * (OR ANY PERSON OR ENTITY CLAIMING RIGHTS DERIVED FROM YOU) FOR ANY LOSS, DAMAGES, OR CLAIMS WHATSOEVER, INCLUDING,
 * WITHOUT LIMITATION, ANY DIRECT, CONSEQUENTIAL, SPECIAL, INDIRECT, PUNITIVE, OR INCIDENTAL DAMAGES; ANY LOST PROFITS,
 * OTHER ECONOMIC DAMAGE, PROPERTY DAMAGE, OR PERSONAL INJURY; AND EVEN IF RENESAS HAS BEEN ADVISED OF THE POSSIBILITY
 * OF SUCH LOSS, DAMAGES, CLAIMS OR COSTS.
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Includes
 **********************************************************************************************************************/
#include "bsp_api.h"
#include <string.h>
#include "r_flash_hp.h"

/* Configuration for this package. */
#include "r_flash_hp_cfg.h"

/***********************************************************************************************************************
 * Typedef definitions
 **********************************************************************************************************************/

#if defined(__ARMCC_VERSION) || defined(__ICCARM__)
typedef void (BSP_CMSE_NONSECURE_CALL * flash_hp_prv_ns_callback)(flash_callback_args_t * p_args);
#elif defined(__GNUC__)
typedef BSP_CMSE_NONSECURE_CALL void (*volatile flash_hp_prv_ns_callback)(flash_callback_args_t * p_args);
#endif

/***********************************************************************************************************************
 * Macro definitions
 **********************************************************************************************************************/

#define FLASH_HP_FENTRYR_PE_MODE_BITS                 (0x0081U)
#define FLASH_HP_FSTATR_FLWEERR                       (1U << 6U)
#define FLASH_HP_FSTATR_PRGERR                        (1U << 12U)
#define FLASH_HP_FSTATR_ERSERR                        (1U << 13U)
#define FLASH_HP_FSTATR_ILGLERR                       (1U << 14U)
#define FLASH_HP_FSTATR_OTERR                         (1U << 20U)
#define FLASH_HP_FSTATR_SECERR                        (1U << 21U)
#define FLASH_HP_FSTATR_FESETERR                      (1U << 22U)
#define FLASH_HP_FSTATR_ILGCOMERR                     (1U << 23U)

#define FLASH_HP_FSTATR_ERROR_MASK                    (FLASH_HP_FSTATR_FLWEERR | FLASH_HP_FSTATR_PRGERR | \
                                                       FLASH_HP_FSTATR_ERSERR |                           \
                                                       FLASH_HP_FSTATR_ILGLERR | FLASH_HP_FSTATR_OTERR |  \
                                                       FLASH_HP_FSTATR_SECERR |                           \
                                                       FLASH_HP_FSTATR_FESETERR | FLASH_HP_FSTATR_ILGCOMERR)

/** "OPEN" in ASCII, used to avoid multiple open. */
#define FLASH_HP_OPEN                                 (0x4f50454eU)
#define FLASH_HP_CLOSE                                (0U)

/* Minimum FCLK for Flash Operations in Hz */
#define FLASH_HP_MINIMUM_SUPPORTED_FCLK_FREQ          (4000000U)

/* Smallest Code Flash block size */
#define FLASH_HP_CODE_SMALL_BLOCK_SZ                  (8192U)

/* Largest Code Flash block size */
#define FLASH_HP_CODE_LARGE_BLOCK_SZ                  (32768U)

#define FLASH_HP_DATA_BLOCK_SIZE                      (64U)

/** The maximum timeout for commands is 100usec when FCLK is 16 MHz i.e. 1600 FCLK cycles.
 * Assuming worst case of ICLK at 240 MHz and FCLK at 4 MHz, and optimization set to max such that
 * each count decrement loop takes only 5 cycles, then ((240/4)*1600)/5 = 19200 */
#define FLASH_HP_FRDY_CMD_TIMEOUT                     (19200)

/** Time that it would take for the Data Buffer to be empty (DBFULL Flag) is 90 FCLK cycles.
 * Assuming worst case of ICLK at 240 MHz and FCLK at 4 MHz, and optimization set to max such that
 * each count decrement loop takes only 5 cycles, then ((240/4)*90)/5 = 1080 */
#define FLASH_HP_DBFULL_TIMEOUT                       (1080U)

/** R_FACI Commands */
#define FLASH_HP_FACI_CMD_PROGRAM                     (0xE8U)
#define FLASH_HP_FACI_CMD_PROGRAM_CF                  (0x80U)
#define FLASH_HP_FACI_CMD_PROGRAM_DF                  (0x02U)
#define FLASH_HP_FACI_CMD_BLOCK_ERASE                 (0x20U)
#define FLASH_HP_FACI_CMD_PE_SUSPEND                  (0xB0U)
#define FLASH_HP_FACI_CMD_PE_RESUME                   (0xD0U)
#define FLASH_HP_FACI_CMD_STATUS_CLEAR                (0x50U)
#define FLASH_HP_FACI_CMD_FORCED_STOP                 (0xB3U)
#define FLASH_HP_FACI_CMD_BLANK_CHECK                 (0x71U)
#define FLASH_HP_FACI_CMD_CONFIG_SET_1                (0x40U)
#define FLASH_HP_FACI_CMD_CONFIG_SET_2                (0x08U)
#define FLASH_HP_FACI_CMD_LOCK_BIT_PGM                (0x77U)
#define FLASH_HP_FACI_CMD_LOCK_BIT_READ               (0x71U)
#define FLASH_HP_FACI_CMD_FINAL                       (0xD0U)

/**  Configuration set Command offset*/
#define FLASH_HP_FCU_CONFIG_SET_ID_BYTE               (0x0000A150U)
#if !(defined(BSP_MCU_GROUP_RA6M4) || defined(BSP_MCU_GROUP_RA4M3) || defined(BSP_MCU_GROUP_RA4M2) || \
    defined(BSP_MCU_GROUP_RA6M5) || defined(BSP_MCU_GROUP_RA4E1) || defined(BSP_MCU_GROUP_RA6E1) ||   \
    defined(BSP_MCU_GROUP_RA6T2))
 #define FLASH_HP_FCU_CONFIG_SET_ACCESS_STARTUP       (0x0000A160U)
#else
 #define FLASH_HP_FCU_CONFIG_SET_DUAL_MODE            (0x0100A110U)
 #define FLASH_HP_FCU_CONFIG_SET_ACCESS_STARTUP       (0x0100A130U)
 #define FLASH_HP_FCU_CONFIG_SET_BANK_MODE            (0x0100A190U)
#endif

