bluekitchen/btstack/port/renesas-ek-ra6m4a-da14531/e2-project/ra/fsp/src/r_flash_hp/r_flash_hp.c
/* Zero based offset into g_configuration_area_data[] for FAWS */
#define FLASH_HP_FCU_CONFIG_SET_FAWS_OFFSET           (2U)

/* Zero based offset into g_configuration_area_data[] for FAWE and BTFLG */
#define FLASH_HP_FCU_CONFIG_SET_FAWE_BTFLG_OFFSET     (3U)

/* These bits must always be set when writing to the configuration area. */
#define FLASH_HP_FCU_CONFIG_FAWE_BTFLG_UNUSED_BITS    (0x7800U)
#define FLASH_HP_FCU_CONFIG_FAWS_UNUSED_BITS          (0xF800U)

/* 8 words need to be written */
#define FLASH_HP_CONFIG_SET_ACCESS_WORD_CNT           (8U)

#define FLASH_HP_FSUACR_KEY                           (0x6600U)

#define FLASH_HP_SAS_KEY                              (0x6600U)

/** Register masks */
#define FLASH_HP_FPESTAT_NON_LOCK_BIT_PGM_ERROR       (0x0002U) // Bits indicating Non Lock Bit related Programming error.
#define FLASH_HP_FPESTAT_NON_LOCK_BIT_ERASE_ERROR     (0x0012U) // Bits indicating Non Lock Bit related Erasure error.
#define FLASH_HP_FENTRYR_DF_PE_MODE                   (0x0080U) // Bits indicating that Data Flash is in P/E mode.
#define FLASH_HP_FENTRYR_CF_PE_MODE                   (0x0001U) // Bits indicating that CodeFlash is in P/E mode.
#define FLASH_HP_FENTRYR_TRANSITION_TO_CF_PE          (0xAA01U) // Key Code to transition to CF P/E mode.
#define FLASH_HP_FENTRYR_TRANSITION_TO_DF_PE          (0xAA80U) // Key Code to transition to DF P/E mode.

#define FLASH_HP_FREQUENCY_IN_HZ                      (1000000U)

#define FLASH_HP_FENTRYR_READ_MODE                    (0xAA00U)

#define FLASH_HP_FMEPROT_LOCK                         (0xD901)
#define FLASH_HP_FMEPROT_UNLOCK                       (0xD900)

#define FLASH_HP_OFS_SAS_MASK                         (0x7FFFU)

#define FLASH_HP_FAEINT_DFAEIE                        (0x08)
#define FLASH_HP_FAEINT_CMDLKIE                       (0x10)
#define FLASH_HP_FAEINT_CFAEIE                        (0x80)
#define FLASH_HP_ERROR_INTERRUPTS_ENABLE              (FLASH_HP_FAEINT_DFAEIE | FLASH_HP_FAEINT_CMDLKIE | \
                                                       FLASH_HP_FAEINT_CFAEIE)

#define FLASH_HP_FPCKAR_KEY                           (0x1E00U)

#define FLASH_HP_MAX_WRITE_CF_US                      (15800)
#define FLASH_HP_MAX_WRITE_DF_US                      (3800)
#define FLASH_HP_MAX_DBFULL_US                        (2)
#define FLASH_HP_MAX_BLANK_CHECK_US                   (84)
#define FLASH_HP_MAX_WRITE_CONFIG_US                  (307000)
#define FLASH_HP_MAX_ERASE_DF_BLOCK_US                (18000)
#define FLASH_HP_MAX_ERASE_CF_LARGE_BLOCK_US          (1040000)
#define FLASH_HP_MAX_ERASE_CF_SMALL_BLOCK_US          (260000)

#define FLASH_HP_FASTAT_DFAE                          (0x08)
#define FLASH_HP_FASTAT_CFAE                          (0x80)
#define FLASH_HP_FASTAT_CMDLK                         (0x10)

#if BSP_FEATURE_FLASH_HP_SUPPORTS_DUAL_BANK
 #define FLASH_HP_PRV_DUALSEL_BANKMD_MASK             (0x7U)
 #define FLASH_HP_PRV_BANKSEL_BANKSWP_MASK            (0x7U)
 #define FLASH_HP_PRV_BANK1_MASK                      (~BSP_FEATURE_FLASH_HP_CF_DUAL_BANK_START)
#else
 #define FLASH_HP_PRV_BANK1_MASK                      (UINT32_MAX)
#endif

/* The number of CPU cycles per each timeout loop. */
#ifndef R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP
 #if defined(__GNUC__)
  #define R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP    (6U)
 #elif defined(__ICCARM__)
  #define R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP    (6U)
 #endif
#endif

#define FLASH_HP_REGISTER_WAIT_TIMEOUT(val, reg, timeout, err) \
    while (val != reg)                                         \
    {                                                          \
        if (0 == timeout)                                      \
        {                                                      \
            return err;                                        \
        }                                                      \
        timeout--;                                             \
    }

/***********************************************************************************************************************
 * Private global variables
 **********************************************************************************************************************/

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
static uint16_t g_configuration_area_data[FLASH_HP_CONFIG_SET_ACCESS_WORD_CNT] = {UINT16_MAX};
#endif

#define FLASH_HP_DF_START_ADDRESS    (BSP_FEATURE_FLASH_DATA_FLASH_START)

static const flash_block_info_t g_code_flash_macro_info[] =
{
    {
        .block_section_st_addr  = 0,
        .block_section_end_addr = UINT16_MAX,
        .block_size             = FLASH_HP_CODE_SMALL_BLOCK_SZ,
        .block_size_write       = BSP_FEATURE_FLASH_HP_CF_WRITE_SIZE
    },
    {
        .block_section_st_addr  = BSP_FEATURE_FLASH_HP_CF_REGION0_SIZE,
        .block_section_end_addr = BSP_ROM_SIZE_BYTES - 1,
        .block_size             = FLASH_HP_CODE_LARGE_BLOCK_SZ,
        .block_size_write       = BSP_FEATURE_FLASH_HP_CF_WRITE_SIZE
    }
};

static const flash_regions_t g_flash_code_region =
{
    .num_regions   = 2,
    .p_block_array = g_code_flash_macro_info
};

const flash_block_info_t g_data_flash_macro_info =
{
    .block_section_st_addr  = FLASH_HP_DF_START_ADDRESS,
    .block_section_end_addr = FLASH_HP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES - 1,
    .block_size             = FLASH_HP_DATA_BLOCK_SIZE,
    .block_size_write       = BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE
};

static flash_regions_t g_flash_data_region =
{
    .num_regions   = 1,
    .p_block_array = &g_data_flash_macro_info
};

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_HP_SUPPORTS_DUAL_BANK == 1)
static volatile uint32_t * const flash_hp_banksel = (uint32_t *) FLASH_HP_FCU_CONFIG_SET_BANK_MODE;
 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
static volatile uint32_t * const flash_hp_dualsel = (uint32_t *) FLASH_HP_FCU_CONFIG_SET_DUAL_MODE;
 #endif
#endif

