bluekitchen/btstack/port/renesas-ek-ra6m4a-da14531/e2-project/ra/fsp/src/r_flash_hp/r_flash_hp.c
/***********************************************************************************************************************
 * Private function prototypes
 **********************************************************************************************************************/

void fcu_fiferr_isr(void);
void fcu_frdyi_isr(void);

/* Internal functions. */
static fsp_err_t flash_hp_init(flash_hp_instance_ctrl_t * p_ctrl);

static fsp_err_t flash_hp_enter_pe_df_mode(flash_hp_instance_ctrl_t * const p_ctrl);

static fsp_err_t flash_hp_pe_mode_exit() PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_reset(flash_hp_instance_ctrl_t * p_ctrl) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_stop(void) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_status_clear() PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_erase_block(flash_hp_instance_ctrl_t * const p_ctrl, uint32_t block_size,
                                      uint32_t timeout) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_write_data(flash_hp_instance_ctrl_t * const p_ctrl, uint32_t write_size,
                                     uint32_t timeout) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_check_errors(fsp_err_t previous_error, uint32_t error_bits,
                                       fsp_err_t return_error) PLACE_IN_RAM_SECTION;

static void r_flash_hp_call_callback(flash_hp_instance_ctrl_t * p_ctrl, flash_event_t event);

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

static fsp_err_t flash_hp_df_blank_check(flash_hp_instance_ctrl_t * const p_ctrl,
                                         uint32_t const                   address,
                                         uint32_t                         num_bytes,
                                         flash_result_t                 * p_blank_check_result);

static fsp_err_t flash_hp_df_write(flash_hp_instance_ctrl_t * const p_ctrl);

static fsp_err_t flash_hp_df_erase(flash_hp_instance_ctrl_t * p_ctrl, uint32_t block_address, uint32_t num_blocks);

#endif

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

static fsp_err_t flash_hp_configuration_area_write(flash_hp_instance_ctrl_t * p_ctrl,
                                                   uint32_t                   fsaddr) PLACE_IN_RAM_SECTION;

static void flash_hp_configuration_area_data_setup(uint32_t btflg_swap, uint32_t start_addr,
                                                   uint32_t end_addr) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_cf_write(flash_hp_instance_ctrl_t * const p_ctrl) PLACE_IN_RAM_SECTION;

 #if (BSP_FEATURE_FLASH_HP_SUPPORTS_DUAL_BANK == 1)
static fsp_err_t flash_hp_bank_swap(flash_hp_instance_ctrl_t * const p_ctrl) PLACE_IN_RAM_SECTION;

 #endif

static fsp_err_t flash_hp_cf_erase(flash_hp_instance_ctrl_t * p_ctrl, uint32_t block_address,
                                   uint32_t num_blocks) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_enter_pe_cf_mode(flash_hp_instance_ctrl_t * const p_ctrl) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_access_window_set(flash_hp_instance_ctrl_t * p_ctrl,
                                            uint32_t const             start_addr,
                                            uint32_t const             end_addr) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_set_startup_area_boot(flash_hp_instance_ctrl_t * p_ctrl,
                                                flash_startup_area_swap_t  swap_type,
                                                bool                       is_temporary) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_set_id_code(flash_hp_instance_ctrl_t * p_ctrl,
                                      uint8_t const * const      p_id_code,
                                      flash_id_code_mode_t       mode) PLACE_IN_RAM_SECTION;

#endif

#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

static fsp_err_t r_flash_hp_common_parameter_checking(flash_hp_instance_ctrl_t * const p_ctrl);

static fsp_err_t r_flash_hp_write_bc_parameter_checking(flash_hp_instance_ctrl_t * const p_ctrl,
                                                        uint32_t                         flash_address,
                                                        uint32_t const                   num_bytes,
                                                        bool                             check_write);

#endif

/***********************************************************************************************************************
 * Exported global variables
 **********************************************************************************************************************/

const flash_api_t g_flash_on_flash_hp =
{
    .open                 = R_FLASH_HP_Open,
    .close                = R_FLASH_HP_Close,
    .write                = R_FLASH_HP_Write,
    .erase                = R_FLASH_HP_Erase,
    .blankCheck           = R_FLASH_HP_BlankCheck,
    .statusGet            = R_FLASH_HP_StatusGet,
    .infoGet              = R_FLASH_HP_InfoGet,
    .accessWindowSet      = R_FLASH_HP_AccessWindowSet,
    .accessWindowClear    = R_FLASH_HP_AccessWindowClear,
    .idCodeSet            = R_FLASH_HP_IdCodeSet,
    .reset                = R_FLASH_HP_Reset,
    .startupAreaSelect    = R_FLASH_HP_StartUpAreaSelect,
    .updateFlashClockFreq = R_FLASH_HP_UpdateFlashClockFreq,
    .bankSwap             = R_FLASH_HP_BankSwap,
    .callbackSet          = R_FLASH_HP_CallbackSet,
};

/*******************************************************************************************************************//**
 * @addtogroup FLASH_HP
 * @{
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Functions
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * Initializes the high performance flash peripheral. Implements @ref flash_api_t::open.
 *
 * The Open function initializes the Flash.
 *
 * Example:
 * @snippet r_flash_hp_example.c R_FLASH_HP_Open
 *
 * @retval     FSP_SUCCESS               Initialization was successful and timer has started.
 * @retval     FSP_ERR_ALREADY_OPEN      The flash control block is already open.
 * @retval     FSP_ERR_ASSERTION         NULL provided for p_ctrl or p_cfg.
 * @retval     FSP_ERR_IRQ_BSP_DISABLED  Caller is requesting BGO but the Flash interrupts are not enabled.
 * @retval     FSP_ERR_FCLK              FCLK must be a minimum of 4 MHz for Flash operations.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_Open (flash_ctrl_t * const p_api_ctrl, flash_cfg_t const * const p_cfg)
{
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;
    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE)

