bluekitchen/btstack/port/renesas-ek-ra6m4a-da14531/e2-project/ra/fsp/src/r_flash_hp/r_flash_hp.c
#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

    /* Verify the control block is not null and is opened. */
    err = r_flash_hp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    if (true == p_ctrl->p_cfg->data_flash_bgo)
    {
        FSP_ASSERT(NULL != p_ctrl->p_callback);
    }

    /* If invalid number of blocks return error. */
    FSP_ERROR_RETURN(num_blocks != 0U, FSP_ERR_INVALID_BLOCKS);
#endif

    p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
    if (address < BSP_FEATURE_FLASH_DATA_FLASH_START)
    {
        uint32_t start_address = 0;
 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
        uint32_t region0_blocks = 0;
 #endif

        /* Configure the current parameters based on if the operation is for code flash or data flash. */
        if ((address & FLASH_HP_PRV_BANK1_MASK) < BSP_FEATURE_FLASH_HP_CF_REGION0_SIZE)
        {
            start_address = address & ~(BSP_FEATURE_FLASH_HP_CF_REGION0_BLOCK_SIZE - 1);

 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
            region0_blocks = (BSP_FEATURE_FLASH_HP_CF_REGION0_SIZE - (start_address & FLASH_HP_PRV_BANK1_MASK)) /
                             BSP_FEATURE_FLASH_HP_CF_REGION0_BLOCK_SIZE;
 #endif
        }
        else
        {
            start_address = address & ~(BSP_FEATURE_FLASH_HP_CF_REGION1_BLOCK_SIZE - 1);
        }

 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
        uint32_t num_bytes = (region0_blocks * BSP_FEATURE_FLASH_HP_CF_REGION0_BLOCK_SIZE);
        if (num_blocks > region0_blocks)
        {
            num_bytes += ((num_blocks - region0_blocks) * BSP_FEATURE_FLASH_HP_CF_REGION1_BLOCK_SIZE);
        }

  #if BSP_FEATURE_FLASH_HP_SUPPORTS_DUAL_BANK
        uint32_t rom_end =
            (FLASH_HP_PRV_DUALSEL_BANKMD_MASK ==
             (*flash_hp_dualsel & FLASH_HP_PRV_DUALSEL_BANKMD_MASK)) ? BSP_ROM_SIZE_BYTES : BSP_ROM_SIZE_BYTES / 2;

        FSP_ERROR_RETURN((start_address & FLASH_HP_PRV_BANK1_MASK) + num_bytes <= rom_end, FSP_ERR_INVALID_BLOCKS);
  #else
        FSP_ERROR_RETURN(start_address + num_bytes <= BSP_ROM_SIZE_BYTES, FSP_ERR_INVALID_BLOCKS);
  #endif
 #endif

        err = flash_hp_cf_erase(p_ctrl, start_address, num_blocks);
    }
    else
#endif
    {
#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)
        uint32_t start_address = address & ~(BSP_FEATURE_FLASH_HP_DF_BLOCK_SIZE - 1);

 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
        uint32_t num_bytes = num_blocks * BSP_FEATURE_FLASH_HP_DF_BLOCK_SIZE;

        FSP_ERROR_RETURN((start_address >= (FLASH_HP_DF_START_ADDRESS)) &&
                         (start_address < (FLASH_HP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES)),
                         FSP_ERR_INVALID_ADDRESS);

        FSP_ERROR_RETURN(start_address + num_bytes <= (FLASH_HP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES),
                         FSP_ERR_INVALID_BLOCKS);
 #endif

        /* Initiate the flash erase. */
        err = flash_hp_df_erase(p_ctrl, start_address, num_blocks);
        FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
#else

        return FSP_ERR_INVALID_ADDRESS;
#endif
    }

    return err;
}

/*******************************************************************************************************************//**
 * Performs a blank check on the specified address area. Implements @ref flash_api_t::blankCheck.
 *
 * Example:
 * @snippet r_flash_hp_example.c R_FLASH_HP_BlankCheck
 *
 * @retval     FSP_SUCCESS                 Blank check operation completed with result in p_blank_check_result, or
 *                                         blank check started and in-progess (BGO mode).
 * @retval     FSP_ERR_INVALID_ADDRESS     Invalid data flash address was input.
 * @retval     FSP_ERR_INVALID_SIZE        'num_bytes' was either too large or not aligned for the CF/DF boundary size.
 * @retval     FSP_ERR_IN_USE              Other flash operation in progress or API not initialized.
 * @retval     FSP_ERR_ASSERTION           NULL provided for p_ctrl.
 * @retval     FSP_ERR_CMD_LOCKED          FCU is in locked state, typically as a result of attempting to Erase an area
 *                                         that is protected by an Access Window.
 * @retval     FSP_ERR_NOT_OPEN            The Flash API is not Open.
 * @retval     FSP_ERR_TIMEOUT             Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_PE_FAILURE          Failed to enter or exit P/E mode.
 * @retval     FSP_ERR_BLANK_CHECK_FAILED  Blank check operation failed.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_BlankCheck (flash_ctrl_t * const p_api_ctrl,
                                 uint32_t const       address,
                                 uint32_t             num_bytes,
                                 flash_result_t     * p_blank_check_result)
{
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;
    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

    /* Check parameters. If failure return error */
    err = r_flash_hp_write_bc_parameter_checking(p_ctrl, address, num_bytes, false);
    FSP_ERROR_RETURN((err == FSP_SUCCESS), err);
#endif

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

    /* Is this a request to Blank check Code Flash? */
    /* If the address is code flash check if the region is blank. If not blank return error. */
    if (address < BSP_ROM_SIZE_BYTES)
    {
        /* Blank checking for Code Flash does not require any FCU operations. The specified address area
         * can simply be checked for non 0xFF. */
        p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;
        *p_blank_check_result     = FLASH_RESULT_BLANK; // Assume blank until we know otherwise
        uint8_t * p_address = (uint8_t *) address;
        for (uint32_t index = 0U; index < num_bytes; index++)
        {
            if (p_address[index] != UINT8_MAX)
            {
                *p_blank_check_result = FLASH_RESULT_NOT_BLANK;
                break;
            }
        }
    }
    /* Otherwise the address is data flash. Put the flash in the blank check state. Return status. */
    else
#endif
    {
#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)
        err = flash_hp_df_blank_check(p_ctrl, address, num_bytes, p_blank_check_result);
#endif
    }

