bluekitchen/btstack/port/renesas-ek-ra6m4a-da14531/e2-project/ra/fsp/src/r_flash_hp/r_flash_hp.c
    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Releases any resources that were allocated by the Open() or any subsequent Flash operations. Implements
 * @ref flash_api_t::close.
 *
 * @retval     FSP_SUCCESS        Successful close.
 * @retval     FSP_ERR_NOT_OPEN   The control block is not open.
 * @retval     FSP_ERR_ASSERTION  NULL provided for p_ctrl or p_cfg.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_Close (flash_ctrl_t * const p_api_ctrl)
{
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;

    /* Eliminate warning if parameter checking is disabled. */
    FSP_PARAMETER_NOT_USED(p_ctrl);

    fsp_err_t err = FSP_SUCCESS;

#if FLASH_HP_CFG_PARAM_CHECKING_ENABLE

    /* If null pointer return error. */
    FSP_ASSERT(NULL != p_ctrl);

    /* If the flash api is not open return an error. */
    FSP_ERROR_RETURN(FLASH_HP_OPEN == p_ctrl->opened, FSP_ERR_NOT_OPEN);
#endif

    /* Close the API */
    p_ctrl->opened = FLASH_HP_CLOSE;

    if (p_ctrl->p_cfg->irq >= 0)
    {
        /* Disable interrupt in ICU */
        R_BSP_IrqDisable(p_ctrl->p_cfg->irq);
    }

    /* Disable Flash Rdy interrupt in the FLASH peripheral */
    R_FACI_HP->FRDYIE = 0x00U;

    if (p_ctrl->p_cfg->err_irq >= 0)
    {
        /* Disable interrupt in ICU */
        R_BSP_IrqDisable(p_ctrl->p_cfg->err_irq);
    }

    /* Disable Flash Error interrupt in the FLASH peripheral */
    R_FACI_HP->FAEINT = 0x00U;

    return err;
}

/*******************************************************************************************************************//**
 * Updates the user callback with the option to provide memory for the callback argument structure.
 * Implements @ref flash_api_t::callbackSet.
 *
 * @retval  FSP_SUCCESS                  Callback updated successfully.
 * @retval  FSP_ERR_ASSERTION            A required pointer is NULL.
 * @retval  FSP_ERR_NOT_OPEN             The control block has not been opened.
 * @retval  FSP_ERR_NO_CALLBACK_MEMORY   p_callback is non-secure and p_callback_memory is either secure or NULL.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_CallbackSet (flash_ctrl_t * const          p_api_ctrl,
                                  void (                      * p_callback)(flash_callback_args_t *),
                                  void const * const            p_context,
                                  flash_callback_args_t * const p_callback_memory)
{
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;

#if FLASH_HP_CFG_PARAM_CHECKING_ENABLE
    FSP_ASSERT(p_ctrl);
    FSP_ASSERT(p_callback);
    FSP_ERROR_RETURN(FLASH_HP_OPEN == p_ctrl->opened, FSP_ERR_NOT_OPEN);
#endif

#if BSP_TZ_SECURE_BUILD

    /* Get security state of p_callback */
    bool callback_is_secure =
        (NULL == cmse_check_address_range((void *) p_callback, sizeof(void *), CMSE_AU_NONSECURE));

 #if FLASH_HP_CFG_PARAM_CHECKING_ENABLE

    /* In secure projects, p_callback_memory must be provided in non-secure space if p_callback is non-secure */
    flash_callback_args_t * const p_callback_memory_checked = cmse_check_pointed_object(p_callback_memory,
                                                                                        CMSE_AU_NONSECURE);
    FSP_ERROR_RETURN(callback_is_secure || (NULL != p_callback_memory_checked), FSP_ERR_NO_CALLBACK_MEMORY);
 #endif
#endif

    /* Store callback and context */
#if BSP_TZ_SECURE_BUILD
    p_ctrl->p_callback = callback_is_secure ? p_callback :
                         (void (*)(flash_callback_args_t *))cmse_nsfptr_create(p_callback);
#else
    p_ctrl->p_callback = p_callback;
#endif
    p_ctrl->p_context         = p_context;
    p_ctrl->p_callback_memory = p_callback_memory;

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * @} (end addtogroup FLASH_HP)
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * Write data to the flash.
 *
 * @param      p_ctrl              Pointer to the control block
 * @param[in]  write_size          The write size
 * @param[in]  timeout             The timeout
 *
 * @retval     FSP_SUCCESS         Write completed succesfully
 * @retval     FSP_ERR_TIMEOUT     Flash timed out during write operation.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_write_data (flash_hp_instance_ctrl_t * const p_ctrl, uint32_t write_size, uint32_t timeout)
{
    volatile uint32_t wait_count;

    /* Set block start address */
    R_FACI_HP->FSADDR = p_ctrl->dest_end_address;

    /* Issue two part Write commands */
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_PROGRAM;
    R_FACI_HP_CMD->FACI_CMD8 = (uint8_t) (write_size / 2U);

    /* Write one line. If timeout stop the flash and return error. */
    for (uint32_t i = 0U; i < (write_size / 2U); i++)
    {
        wait_count = p_ctrl->timeout_dbfull;

        /* Copy data from source address to destination area */
        R_FACI_HP_CMD->FACI_CMD16 = *(uint16_t *) p_ctrl->source_start_address;

        while (R_FACI_HP->FSTATR_b.DBFULL == 1U)
        {
            /* Wait until DBFULL is 0 unless timeout occurs. */
            if (wait_count-- == 0U)
            {

                /* If DBFULL is not set to 0 return timeout. */
                return FSP_ERR_TIMEOUT;
            }
        }

        /* Each write handles 2 bytes of data. */
        p_ctrl->source_start_address += 2U;
        p_ctrl->dest_end_address     += 2U;
        p_ctrl->operations_remaining--;
    }

