bluekitchen/btstack/port/renesas-ek-ra6m4a-da14531/e2-project/ra/fsp/src/r_flash_hp/r_flash_hp.c
    /* If in BGO mode, exit here; remaining processing if any will be done in ISR */
    if (p_ctrl->p_cfg->data_flash_bgo == true)
    {
        p_ctrl->current_operation = FLASH_OPERATION_DF_BGO_WRITE;
        wait_count                = 0;
    }
    else
    {
        wait_count = p_ctrl->timeout_write_df;
    }

    do
    {
        err = flash_hp_write_data(p_ctrl, BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE, wait_count);

        if (p_ctrl->p_cfg->data_flash_bgo)
        {

            /* Errors will be handled in the error interrupt when using BGO. */
            return err;
        }

        err = flash_hp_check_errors(err, FLASH_HP_FSTATR_PRGERR, FSP_ERR_WRITE_FAILED);
    } while (p_ctrl->operations_remaining && (err == FSP_SUCCESS));

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    return err;
}

#endif

#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function performs the parameter checking required by the write, read and blank check functions.
 *
 * @param[in]  p_ctrl                   Flash control block
 * @param[in]  flash_address            The flash address to be written to
 * @param[in]  num_bytes                The number bytes
 * @param[in]  check_write              Check that the parameters are valid for a write.
 *
 * @retval     FSP_SUCCESS              Parameter checking completed without error.
 * @retval     FSP_ERR_IN_USE           The Flash peripheral is busy with a prior on-going transaction.
 * @retval     FSP_ERR_NOT_OPEN         The Flash API is not Open.
 * @retval     FSP_ERR_ASSERTION        Null pointer
 * @retval     FSP_ERR_INVALID_SIZE     Number of bytes provided was not a multiple of the programming size or exceeded
 *                                      the maximum range.
 * @retval     FSP_ERR_INVALID_ADDRESS  Invalid address was input or address not on programming boundary.
 **********************************************************************************************************************/
static fsp_err_t r_flash_hp_write_bc_parameter_checking (flash_hp_instance_ctrl_t * const p_ctrl,
                                                         uint32_t                         flash_address,
                                                         uint32_t const                   num_bytes,
                                                         bool                             check_write)
{
    /* Verify the control block is not null and is opened. Verify the flash isn't in use. */
    fsp_err_t err = r_flash_hp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    uint32_t write_size;

    if (p_ctrl->p_cfg->data_flash_bgo == true)
    {
        FSP_ASSERT(NULL != p_ctrl->p_callback);
    }

    /* If invalid address or number of bytes return error. */
 #if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
    if (flash_address < BSP_FEATURE_FLASH_DATA_FLASH_START)
    {
        uint32_t rom_end = BSP_ROM_SIZE_BYTES;
  #if BSP_FEATURE_FLASH_HP_SUPPORTS_DUAL_BANK
        if (0 == (FLASH_HP_PRV_DUALSEL_BANKMD_MASK & *flash_hp_dualsel))
        {
            flash_address = flash_address % BSP_FEATURE_FLASH_HP_CF_DUAL_BANK_START;
            rom_end       = BSP_ROM_SIZE_BYTES / 2;
        }
  #endif

        FSP_ERROR_RETURN(flash_address + num_bytes <= rom_end, FSP_ERR_INVALID_SIZE);
        write_size = BSP_FEATURE_FLASH_HP_CF_WRITE_SIZE;
    }
    else
 #endif
    {
 #if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)
        FSP_ERROR_RETURN((flash_address >= (FLASH_HP_DF_START_ADDRESS)) &&
                         (flash_address < (FLASH_HP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES)),
                         FSP_ERR_INVALID_ADDRESS);
        FSP_ERROR_RETURN((flash_address + num_bytes <= (FLASH_HP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES)),
                         FSP_ERR_INVALID_SIZE);
        write_size = BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE;
 #else

        return FSP_ERR_INVALID_ADDRESS;
 #endif
    }

    if (check_write)
    {
        FSP_ERROR_RETURN(!(flash_address & (write_size - 1U)), FSP_ERR_INVALID_ADDRESS);
        FSP_ERROR_RETURN(!(num_bytes & (write_size - 1U)), FSP_ERR_INVALID_SIZE);
    }

    /* If invalid number of bytes return error. */
    FSP_ERROR_RETURN((0 != num_bytes), FSP_ERR_INVALID_SIZE);

    /* If control block is not open return error. */
    FSP_ERROR_RETURN((FLASH_HP_OPEN == p_ctrl->opened), FSP_ERR_NOT_OPEN);

    return FSP_SUCCESS;
}

#endif

#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function performs the common parameter checking required by top level API functions.
 * @param      p_ctrl             Pointer to the control block
 * @retval     FSP_SUCCESS        Parameter checking completed without error.
 * @retval     FSP_ERR_ASSERTION  Null pointer
 * @retval     FSP_ERR_NOT_OPEN   The flash module is not open.
 * @retval     FSP_ERR_IN_USE     The Flash peripheral is busy with a prior on-going transaction.
 **********************************************************************************************************************/
static fsp_err_t r_flash_hp_common_parameter_checking (flash_hp_instance_ctrl_t * const p_ctrl)
{
    /* If null control block return error. */
    FSP_ASSERT(p_ctrl);

    /* If control block is not open return error. */
    FSP_ERROR_RETURN((FLASH_HP_OPEN == p_ctrl->opened), FSP_ERR_NOT_OPEN);

    /* If the flash is currently in program/erase mode return an error. */
    FSP_ERROR_RETURN((R_FACI_HP->FENTRYR & FLASH_HP_FENTRYR_PE_MODE_BITS) == 0x0000U, FSP_ERR_IN_USE);

    return FSP_SUCCESS;
}

#endif

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function performs the Blank check phase required by the R_FLASH_HP_BlankCheck() function.
 *
 * @param[in]  p_ctrl                      Flash control block
 * @param[in]  address                     The start address of the range to blank check
 * @param[in]  num_bytes                   The number bytes
 * @param[out] p_blank_check_result        The blank check result
 *
 * @retval     FSP_SUCCESS                 Setup completed completed without error.
 * @retval     FSP_ERR_PE_FAILURE          Failed to enter P/E mode
 * @retval     FSP_ERR_CMD_LOCKED          Peripheral in command locked state.
 * @retval     FSP_ERR_TIMEOUT             Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_BLANK_CHECK_FAILED  Blank check operation failed.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_df_blank_check (flash_hp_instance_ctrl_t * const p_ctrl,
                                          uint32_t const                   address,
                                          uint32_t                         num_bytes,
                                          flash_result_t                 * p_blank_check_result)
{
    fsp_err_t err;

    /* This is a request to Blank check Data Flash */
    err = flash_hp_enter_pe_df_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* Start the Blank check operation. If BGO is enabled then the result of the Blank check will be
     * available when the interrupt occurs and p_blank_check_result will contain FLASH_RESULT_BGO_ACTIVE */

