bluekitchen/btstack/port/renesas-ek-ra6m4a-da14531/e2-project/ra/fsp/src/r_flash_hp/r_flash_hp.c
    /* Call blank check. If successful and not DF BGO operation then enter read mode. */
    /* Set the mode to incremental*/
    R_FACI_HP->FBCCNT = 0x00U;

    /* Set the start address for blank checking*/
    R_FACI_HP->FSADDR = address;

    /* Set the end address for blank checking*/
    R_FACI_HP->FEADDR = (address + num_bytes) - 1U;

    /* Issue two part Blank Check command*/
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_BLANK_CHECK;
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_FINAL;

    /* If in DF BGO mode, exit here; remaining processing if any will be done in ISR */
    if (p_ctrl->p_cfg->data_flash_bgo == true)
    {
        p_ctrl->current_operation = FLASH_OPERATION_DF_BGO_BLANKCHECK;
        *p_blank_check_result     = FLASH_RESULT_BGO_ACTIVE;

        return FSP_SUCCESS;
    }

    /* timeout_blank_check specifies the wait time for a 4 byte blank check,
     * num_bytes is divided by 4 and then multiplied to calculate the wait time for the entire operation*/

    /* Configure the timeout value. */
    uint32_t wait_count = (p_ctrl->timeout_blank_check * ((num_bytes >> 2) + 1));

    /* Wait for the operation to complete or timeout. If timeout stop the module and return error. */

    /* Read FRDY bit until it has been set to 1 indicating that the current
     * operation is complete. */
    while (1U != R_FACI_HP->FSTATR_b.FRDY)
    {
        /* Wait until FRDY is 1 unless timeout occurs. */
        if (wait_count == 0U)
        {
            err = FSP_ERR_TIMEOUT;
            break;
        }

        wait_count--;
    }

    /* Check the status of the Blank Check operation. */
    err = flash_hp_check_errors(err, 0, FSP_ERR_BLANK_CHECK_FAILED);

    /* Set the result to blank or not blank. */
    if (R_FACI_HP->FBCSTAT == 0x01U)
    {
        *p_blank_check_result = FLASH_RESULT_NOT_BLANK;
    }
    else
    {
        *p_blank_check_result = FLASH_RESULT_BLANK;
    }

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    /* Return status. */
    return err;
}

#endif

/*******************************************************************************************************************//**
 * This function will initialize the FCU and set the FCU Clock based on the current FCLK frequency.
 * @param      p_ctrl        Pointer to the instance control block
 * @retval     FSP_SUCCESS   Clock and timeouts configured succesfully.
 * @retval     FSP_ERR_FCLK  FCLK is not within the acceptable range.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_init (flash_hp_instance_ctrl_t * p_ctrl)
{
    p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

    /*Allow Access to the Flash registers*/
    R_SYSTEM->FWEPROR = 0x01U;

    uint32_t flash_clock_freq_hz  = R_FSP_SystemClockHzGet(FSP_PRIV_CLOCK_FCLK);
    uint32_t system_clock_freq_hz = R_FSP_SystemClockHzGet(FSP_PRIV_CLOCK_ICLK);

    FSP_ERROR_RETURN(flash_clock_freq_hz >= FLASH_HP_MINIMUM_SUPPORTED_FCLK_FREQ, FSP_ERR_FCLK);

    /* Round up the frequency to a whole number */
    uint32_t flash_clock_freq_mhz = (flash_clock_freq_hz + (FLASH_HP_FREQUENCY_IN_HZ - 1)) /
                                    FLASH_HP_FREQUENCY_IN_HZ;

    /* Round up the frequency to a whole number */
    uint32_t system_clock_freq_mhz = (system_clock_freq_hz + (FLASH_HP_FREQUENCY_IN_HZ - 1)) /
                                     FLASH_HP_FREQUENCY_IN_HZ;

    /* Set the Clock */
    R_FACI_HP->FPCKAR = (uint16_t) (FLASH_HP_FPCKAR_KEY + flash_clock_freq_mhz);

    /*  According to HW Manual the Max Programming Time for 256 bytes (ROM)
     *  is 15.8ms.  This is with a FCLK of 4MHz. The calculation below
     *  calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_write_cf = (uint32_t) (FLASH_HP_MAX_WRITE_CF_US * system_clock_freq_mhz) /
                               R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Programming Time for 4 bytes
     *  (Data Flash) is 3.8ms.  This is with a FCLK of 4MHz. The calculation
     *  below calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_write_df = (uint32_t) (FLASH_HP_MAX_WRITE_DF_US * system_clock_freq_mhz) /
                               R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Data Buffer Full time for 2 bytes
     *  is 2 usec.  This is with a FCLK of 4MHz. The calculation
     *  below calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_dbfull = (uint32_t) (FLASH_HP_MAX_DBFULL_US * system_clock_freq_mhz) /
                             R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Blank Check time for 4 bytes
     *  (Data Flash) is 84 usec.  This is with a FCLK of 4MHz. The calculation
     *  below calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_blank_check = (uint32_t) (FLASH_HP_MAX_BLANK_CHECK_US * system_clock_freq_mhz) /
                                  R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the max timeout value when using the configuration set
     *  command is 307 ms. This is with a FCLK of 4MHz. The
     *  calculation below calculates the number of ICLK ticks needed for the
     *  timeout delay.
     */
    p_ctrl->timeout_write_config = (uint32_t) (FLASH_HP_MAX_WRITE_CONFIG_US * system_clock_freq_mhz) /
                                   R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Erasure Time for a 64 byte Data Flash block is
     *  around 18ms.  This is with a FCLK of 4MHz. The calculation below
     *  calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_erase_df_block = (uint32_t) (FLASH_HP_MAX_ERASE_DF_BLOCK_US * system_clock_freq_mhz) /
                                     R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

