bluekitchen/btstack/port/renesas-ek-ra6m4a-da14531/e2-project/ra/fsp/src/r_flash_hp/r_flash_hp.c
    /* If in BGO mode, exit here; remaining processing if any will be done in ISR */
    if (p_ctrl->p_cfg->data_flash_bgo)
    {
        p_ctrl->current_operation = FLASH_OPERATION_DF_BGO_ERASE;
        wait_count                = 0;
    }
    else
    {
        wait_count = p_ctrl->timeout_write_df;
    }

    /* Set Erasure Priority Mode*/
    R_FACI_HP->FCPSR = 1U;

    do
    {
        err = flash_hp_erase_block(p_ctrl, BSP_FEATURE_FLASH_HP_DF_BLOCK_SIZE, wait_count);

        if (p_ctrl->p_cfg->data_flash_bgo)
        {
            return err;
        }

        err = flash_hp_check_errors(err, FLASH_HP_FSTATR_ERSERR, FSP_ERR_ERASE_FAILED);
    } while (p_ctrl->operations_remaining && (err == FSP_SUCCESS));

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    return err;
}

#endif

/*******************************************************************************************************************//**
 * This function switches the peripheral from P/E mode for Code Flash or Data Flash to Read mode.
 *
 * @retval     FSP_SUCCESS         Successfully entered P/E mode.
 * @retval     FSP_ERR_PE_FAILURE  Failed to exited P/E mode
 * @retval     FSP_ERR_CMD_LOCKED  Flash entered command locked state.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_pe_mode_exit (void)
{
    /* See "Transition to Read Mode": Section 47.9.3.5 of the RA6M4 manual R01UH0890EJ0100. */
    /* FRDY and CMDLK are checked after the previous commands complete and do not need to be checked again. */
    fsp_err_t err      = FSP_SUCCESS;
    fsp_err_t temp_err = FSP_SUCCESS;
    uint32_t  pe_mode  = R_FACI_HP->FENTRYR;

    uint32_t wait_count = FLASH_HP_FRDY_CMD_TIMEOUT;

    /* Transition to Read mode */
    R_FACI_HP->FENTRYR = FLASH_HP_FENTRYR_READ_MODE;

    /* Wait until the flash is in read mode or timeout. If timeout return error. */
    /* Read FENTRYR until it has been set to 0x0000 indicating that we have successfully exited P/E mode.*/
    while (0U != R_FACI_HP->FENTRYR)
    {
        /* Wait until FENTRYR is 0x0000 unless timeout occurs. */
        if (wait_count == 0U)
        {
            /* If FENTRYR is not set after max timeout, FSP_ERR_PE_FAILURE*/
            err = FSP_ERR_PE_FAILURE;
        }

        wait_count--;
    }

    /* If the device is coming out of code flash p/e mode restore the flash cache state. */
    if (FLASH_HP_FENTRYR_CF_PE_MODE == pe_mode)
    {
#if BSP_FEATURE_FLASH_HP_HAS_FMEPROT
        R_FACI_HP->FMEPROT = FLASH_HP_FMEPROT_LOCK;
#endif

        R_BSP_FlashCacheEnable();
    }

#if BSP_FEATURE_BSP_HAS_CODE_SYSTEM_CACHE
    else if (FLASH_HP_FENTRYR_DF_PE_MODE == pe_mode)
    {
        /* Flush the C-CACHE. */
        R_CACHE->CCAFCT = 1U;
        FSP_HARDWARE_REGISTER_WAIT(R_CACHE->CCAFCT, 0U);
    }
    else
    {
        /* Do nothing. */
    }
#endif

    /* If a command locked state was detected earlier, then return that error. */
    if (FSP_ERR_CMD_LOCKED == temp_err)
    {
        err = temp_err;
    }

    return err;
}

/*******************************************************************************************************************//**
 * This function resets the Flash peripheral.
 * @param[in]  p_ctrl              Pointer to the Flash HP instance control block.
 * @retval     FSP_SUCCESS         Reset completed
 * @retval     FSP_ERR_PE_FAILURE  Failed to enter or exit P/E mode.
 * @retval     FSP_ERR_TIMEOUT     Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_CMD_LOCKED  FCU is in locked state, typically as a result of having received an illegal command.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_reset (flash_hp_instance_ctrl_t * p_ctrl)
{
    /* Disable the FACI interrupts, we don't want the reset itself to generate an interrupt */
    if (p_ctrl->p_cfg->data_flash_bgo)
    {
        R_BSP_IrqDisable(p_ctrl->p_cfg->irq);
        R_BSP_IrqDisable(p_ctrl->p_cfg->err_irq);
    }

    /* If not in PE mode enter PE mode. */
    if (R_FACI_HP->FENTRYR == 0x0000U)
    {
        /* Enter P/E mode so that we can execute some FACI commands. Either Code or Data Flash P/E mode would work
         * but Code Flash P/E mode requires FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1, which may not be true */
        flash_hp_enter_pe_df_mode(p_ctrl);
    }

    /* Issue a Flash Stop to stop any ongoing operation*/
    fsp_err_t err = flash_hp_stop();

    /* Issue a status clear to clear the locked-command state*/
    fsp_err_t temp_err = flash_hp_status_clear();

    /* Keep track of and return the first error encountered. */
    if (FSP_SUCCESS == err)
    {
        err = temp_err;
    }

    /* Transition back to Read mode*/
    temp_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = temp_err;
    }

    /* Cancel any in progress background operation. */
    p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

    return err;
}

/*******************************************************************************************************************//**
 * This function is used to force stop the flash during an ongoing operation.
 *
 * @retval     FSP_SUCCESS         Successful stop.
 * @retval     FSP_ERR_TIMEOUT     Timeout executing flash_stop.
 * @retval     FSP_ERR_CMD_LOCKED  Peripheral in command locked state.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_stop (void)
{
    /* See "Forced Stop Command": Section 47.9.3.13 of the RA6M4 manual R01UH0890EJ0100. If the CMDLK bit
     * is still set after issuing the force stop command return an error. */
    volatile uint32_t wait_count = FLASH_HP_FRDY_CMD_TIMEOUT;

    R_FACI_HP_CMD->FACI_CMD8 = (uint8_t) FLASH_HP_FACI_CMD_FORCED_STOP;

    while (1U != R_FACI_HP->FSTATR_b.FRDY)
    {
        if (wait_count == 0U)
        {
            return FSP_ERR_TIMEOUT;
        }

