bluekitchen/btstack/port/renesas-ek-ra6m4a-da14531/e2-project/ra/fsp/src/r_flash_hp/r_flash_hp.c
        wait_count--;
    }

    if (0U != R_FACI_HP->FASTAT_b.CMDLK)
    {
        return FSP_ERR_CMD_LOCKED;
    }

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * This function is used to clear the command-locked state .
 * @retval     FSP_SUCCESS         Successful stop.
 * @retval     FSP_ERR_TIMEOUT     Timeout executing flash_stop.Failed to exited P/E mode
 * @retval     FSP_ERR_CMD_LOCKED  Peripheral in command locked state
 **********************************************************************************************************************/
static fsp_err_t flash_hp_status_clear (void)
{
    /* See "Status Clear Command": Section 47.9.3.12 of the RA6M4 manual R01UH0890EJ0100. */
    /* Timeout counter. */
    volatile uint32_t wait_count = FLASH_HP_FRDY_CMD_TIMEOUT;

    /*Issue stop command to flash command area*/
    R_FACI_HP_CMD->FACI_CMD8 = (uint8_t) FLASH_HP_FACI_CMD_STATUS_CLEAR;

    /* Read FRDY bit until it has been set to 1 indicating that the current
     * operation is complete.*/
    while (1U != R_FACI_HP->FSTATR_b.FRDY)
    {
        /* Wait until FRDY is 1 unless timeout occurs. */
        if (wait_count == 0U)
        {

            /* This should not happen normally.
             * FRDY should get set in 15-20 ICLK cycles on STOP command*/
            return FSP_ERR_TIMEOUT;
        }

        wait_count--;
    }

    /*Check that Command Lock bit is cleared*/
    if (0U != R_FACI_HP->FASTAT_b.CMDLK)
    {
        return FSP_ERR_CMD_LOCKED;
    }

    return FSP_SUCCESS;
}

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Set up the g_configuration_area_data for writing to the access/startup region of option setting memory.
 *
 * @param[in]  btflg_swap      The btflg swap
 * @param[in]  start_addr      The access window start address
 * @param[in]  end_addr        The access window end address
 **********************************************************************************************************************/
static void flash_hp_configuration_area_data_setup (uint32_t btflg_swap, uint32_t start_addr, uint32_t end_addr)
{
    /* Unused bits should be written as 1. */
    g_configuration_area_data[0] = UINT16_MAX;
    g_configuration_area_data[1] = UINT16_MAX;

    /* Prepare the configuration data. */

    /* Bit 15 is BTFLG(Startup Area Select Flag) */
    /* Bits 10:0 are FAWE(Flash Access Window End Block). */
    /* Unused bits should be written as 1. */
    g_configuration_area_data[FLASH_HP_FCU_CONFIG_SET_FAWE_BTFLG_OFFSET] =
        (uint16_t) (FLASH_HP_FCU_CONFIG_FAWE_BTFLG_UNUSED_BITS | end_addr | (btflg_swap << 15U));

    /* Bits 10:0 are FAWS(Flash Access Window Start Block). */
    /* Unused bits should be written as 1. */
    g_configuration_area_data[FLASH_HP_FCU_CONFIG_SET_FAWS_OFFSET] =
        (uint16_t) (FLASH_HP_FCU_CONFIG_FAWS_UNUSED_BITS | start_addr);

    g_configuration_area_data[4] = UINT16_MAX;
    g_configuration_area_data[5] = UINT16_MAX;
    g_configuration_area_data[6] = UINT16_MAX;
    g_configuration_area_data[7] = UINT16_MAX;
}

#endif

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Configure an access window for the Code Flash memory using the provided start and end address. An access window
 * defines a contiguous area in Code Flash for which programming/erase is enabled. This area is on block boundaries. The
 * block containing start_addr is the first block. The block containing end_addr is the last block. The access window
 * then becomes first block - last block inclusive. Anything outside this range of Code Flash is then write protected.
 * This command DOES modify the configuration via The Configuration Set command to update the FAWS and FAWE.
 *
 * @param      p_ctrl                Pointer to the control block
 * @param[in]  start_addr            Determines the Starting block for the Code Flash access window.
 * @param[in]  end_addr              Determines the Ending block for the Code Flash access window.
 *
 * @retval     FSP_SUCCESS           Access window successfully configured.
 * @retval     FSP_ERR_CMD_LOCKED    FCU is in locked state, typically as a result of having received an illegal
 *                                   command.
 * @retval     FSP_ERR_WRITE_FAILED  Status is indicating a Programming error for the requested operation.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_PE_FAILURE    Failed to enter or exit Code Flash P/E mode.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_access_window_set (flash_hp_instance_ctrl_t * p_ctrl,
                                             uint32_t const             start_addr,
                                             uint32_t const             end_addr)
{
    uint32_t btflg = R_FACI_HP->FAWMON_b.BTFLG;

    /* Update Flash state and enter Code Flash P/E mode */
    fsp_err_t err = flash_hp_enter_pe_cf_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* Configure the configuration area to be written. */
    flash_hp_configuration_area_data_setup(btflg, start_addr >> 13U, end_addr >> 13U);

    /* Write the configuration area to the access/startup region. */
    err = flash_hp_configuration_area_write(p_ctrl, FLASH_HP_FCU_CONFIG_SET_ACCESS_STARTUP);

    err = flash_hp_check_errors(err, 0, FSP_ERR_WRITE_FAILED);

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    return err;
}

#endif

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Modifies the start-up program swap flag (BTFLG) based on the supplied parameters. These changes will take effect on
 * the next reset. This command DOES modify the configuration via The Configuration Set command to update the BTFLG.
 *
 * @param      p_ctrl                Pointer to the instance control block.
 * @param[in]  swap_type             The swap type Alternate or Default.
 * @param[in]  is_temporary          Indicates if the swap should be temporary or permanent.
 *
 * @retval     FSP_SUCCESS           Access window successfully removed.
 * @retval     FSP_ERR_CMD_LOCKED    FCU is in locked state, typically as a result of having received an illegal
 *                                   command.
 * @retval     FSP_ERR_WRITE_FAILED  Status is indicating a Programming error for the requested operation.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_PE_FAILURE    Failed to enter or exit Code Flash P/E mode.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_set_startup_area_boot (flash_hp_instance_ctrl_t * p_ctrl,
                                                 flash_startup_area_swap_t  swap_type,
                                                 bool                       is_temporary)
{
    /* Update Flash state and enter Code Flash P/E mode */
    fsp_err_t err = flash_hp_enter_pe_cf_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    if (is_temporary)
    {
        R_FACI_HP->FSUACR = (uint16_t) (FLASH_HP_FSUACR_KEY | swap_type);
    }
    else
    {
 #if BSP_FEATURE_FLASH_SUPPORTS_ACCESS_WINDOW

        /* Do not call functions with multiple volatile parameters. */
        uint32_t faws = R_FACI_HP->FAWMON_b.FAWS;
        uint32_t fawe = R_FACI_HP->FAWMON_b.FAWE;

