bluekitchen/btstack/port/renesas-ek-ra6m4a-da14531/e2-project/ra/fsp/src/r_flash_hp/r_flash_hp.c
    /* The flash access error interrupt register has fired. */
    /* Check for the data flash memory access violation flag. */
    if (fastat & FLASH_HP_FASTAT_DFAE)
    {
        event = FLASH_EVENT_ERR_DF_ACCESS;
    }
    /* Check for the code flash memory access violation flag. */
    else if (fastat & FLASH_HP_FASTAT_CFAE)
    {
        event = FLASH_EVENT_ERR_CF_ACCESS;
    }
    /* Check if the command Lock bit is set. */
    else if (fastat & FLASH_HP_FASTAT_CMDLK)
    {
        if (fstatr_errors & (FLASH_HP_FSTATR_PRGERR | FLASH_HP_FSTATR_ERSERR))
        {
            event = FLASH_EVENT_ERR_FAILURE;
        }
        else
        {
            event = FLASH_EVENT_ERR_CMD_LOCKED;
        }
    }
    else
    {
        event = FLASH_EVENT_ERR_FAILURE;
    }

    /* Reset the FCU: This will stop any existing processes and exit PE mode*/
    flash_hp_reset(p_ctrl);

    /* Clear the Error Interrupt. */
    R_BSP_IrqStatusClear(irq);

    /* Call the user callback. */
    r_flash_hp_call_callback(p_ctrl, event);

    /* Restore context if RTOS is used */
    FSP_CONTEXT_RESTORE
}

/*******************************************************************************************************************//**
 * FLASH ready interrupt routine.
 *
 * This function implements the FLASH ready isr. The function clears the interrupt request source on entry populates the
 * callback structure with the relevant event, and providing a callback routine has been provided, calls the callback
 * function with the event.
 **********************************************************************************************************************/
void fcu_frdyi_isr (void)
{
    FSP_CONTEXT_SAVE
    bool operation_completed = false;

    /*Wait counter used for DBFULL flag*/
    flash_event_t event;

    IRQn_Type irq = R_FSP_CurrentIrqGet();

    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) R_FSP_IsrContextGet(irq);

    /* Clear the Interrupt Request*/
    R_BSP_IrqStatusClear(irq);

    /* A reset of the FACI with a BGO operation in progress may still generate a single interrupt
     * subsequent to the reset. We want to ignore that */

    /* Continue the current operation. If unknown operation set callback event to failure. */
    if (FLASH_OPERATION_DF_BGO_WRITE == p_ctrl->current_operation)
    {
        /* If there are still bytes to write */
        if (p_ctrl->operations_remaining)
        {
            fsp_err_t err = flash_hp_write_data(p_ctrl, BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE, 0);

            if (FSP_SUCCESS != err)
            {
                flash_hp_reset(p_ctrl);
                event = FLASH_EVENT_ERR_FAILURE;
            }
        }
        /*Done writing all bytes*/
        else
        {
            event               = FLASH_EVENT_WRITE_COMPLETE;
            operation_completed = true;
        }
    }
    else if ((FLASH_OPERATION_DF_BGO_ERASE == p_ctrl->current_operation))
    {
        if (p_ctrl->operations_remaining)
        {
            flash_hp_erase_block(p_ctrl, BSP_FEATURE_FLASH_HP_DF_BLOCK_SIZE, 0);
        }
        /* If all blocks are erased*/
        else
        {
            event               = FLASH_EVENT_ERASE_COMPLETE;
            operation_completed = true;
        }
    }
    else
    {
        /* Blank check is a single operation */
        operation_completed = true;
        if (R_FACI_HP->FBCSTAT == 0x01U)
        {
            event = FLASH_EVENT_NOT_BLANK;
        }
        else
        {
            event = FLASH_EVENT_BLANK;
        }
    }

    /* If the current operation has completed exit pe mode, release the software lock and call the user callback if used. */
    if (operation_completed == true)
    {
        /* finished current operation. Exit P/E mode*/
        flash_hp_pe_mode_exit();

        /* Release lock and Set current state to Idle*/
        p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

        /* Set data to identify callback to user, then call user callback. */
        r_flash_hp_call_callback(p_ctrl, event);
    }

    FSP_CONTEXT_RESTORE
}

/*******************************************************************************************************************//**
 * Calls user callback.
 *
 * @param[in]     p_ctrl     Pointer to FLASH_HP instance control block
 * @param[in]     event      Event code
 **********************************************************************************************************************/
static void r_flash_hp_call_callback (flash_hp_instance_ctrl_t * p_ctrl, flash_event_t event)
{
    flash_callback_args_t args;

    /* Store callback arguments in memory provided by user if available.  This allows callback arguments to be
     * stored in non-secure memory so they can be accessed by a non-secure callback function. */
    flash_callback_args_t * p_args = p_ctrl->p_callback_memory;
    if (NULL == p_args)
    {
        /* Store on stack */
        p_args = &args;
    }
    else
    {
        /* Save current arguments on the stack in case this is a nested interrupt. */
        args = *p_args;
    }

    p_args->event     = event;
    p_args->p_context = p_ctrl->p_context;

#if BSP_TZ_SECURE_BUILD

    /* p_callback can point to a secure function or a non-secure function. */
    if (!cmse_is_nsfptr(p_ctrl->p_callback))
    {
        /* If p_callback is secure, then the project does not need to change security state. */
        p_ctrl->p_callback(p_args);
    }
    else
    {
        /* If p_callback is Non-secure, then the project must change to Non-secure state in order to call the callback. */
        flash_hp_prv_ns_callback p_callback = (flash_hp_prv_ns_callback) (p_ctrl->p_callback);
        p_callback(p_args);
    }

#else

    /* If the project is not Trustzone Secure, then it will never need to change security state in order to call the callback. */
    p_ctrl->p_callback(p_args);
#endif
    if (NULL != p_ctrl->p_callback_memory)
    {
        /* Restore callback memory in case this is a nested interrupt. */
        *p_ctrl->p_callback_memory = args;
    }
}

/*******************************************************************************************************************//**
 * This function switches the peripheral to P/E mode for Data Flash.
 * @param[in]  p_ctrl              Pointer to the Flash control block.
 * @retval     FSP_SUCCESS         Successfully entered Data Flash P/E mode.
 * @retval     FSP_ERR_PE_FAILURE  Failed to enter Data Flash P/E mode.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_enter_pe_df_mode (flash_hp_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

