bluekitchen/btstack/port/renesas-ek-ra6m4a-da14531/e2-project/ra/fsp/src/r_flash_hp/r_flash_hp.c
    /* See "Transition to Data Flash P/E Mode": Section 47.9.3.4 of the RA6M4 manual R01UH0890EJ0100. */
    /* Timeout counter. */
    volatile uint32_t wait_count = FLASH_HP_FRDY_CMD_TIMEOUT;

    /* If BGO mode is enabled and interrupts are being used then enable interrupts. */
    if (p_ctrl->p_cfg->data_flash_bgo == true)
    {
        /* We are supporting Flash Rdy interrupts for Data Flash operations. */
        R_BSP_IrqEnable(p_ctrl->p_cfg->irq);

        /* We are supporting Flash Err interrupts for Data Flash operations. */
        R_BSP_IrqEnable(p_ctrl->p_cfg->err_irq);
    }

    /* Enter Data Flash PE mode. */
    R_FACI_HP->FENTRYR = FLASH_HP_FENTRYR_TRANSITION_TO_DF_PE;

    /* Wait for the operation to complete or timeout. If timeout return error. */
    /* Read FENTRYR until it has been set to 0x0080 indicating that we have successfully entered P/E mode.*/
    while (FLASH_HP_FENTRYR_DF_PE_MODE != R_FACI_HP->FENTRYR)
    {
        /* Wait until FENTRYR is 0x0080 unless timeout occurs. */
        if (wait_count == 0U)
        {

            /* if FENTRYR is not set after max timeout return an error. */
            return FSP_ERR_PE_FAILURE;
        }

        wait_count--;
    }

    return err;
}

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function switches the peripheral to P/E mode for Code Flash.
 * @param[in]  p_ctrl              Pointer to the Flash control block.
 * @retval     FSP_SUCCESS         Successfully entered Code Flash P/E mode.
 * @retval     FSP_ERR_PE_FAILURE  Failed to enter Code Flash P/E mode.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_enter_pe_cf_mode (flash_hp_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

    /* See "Transition to Code Flash P/E Mode": Section 47.9.3.3 of the RA6M4 manual R01UH0890EJ0100. */
    /* Timeout counter. */
    volatile uint32_t wait_count = FLASH_HP_FRDY_CMD_TIMEOUT;

    /* While the Flash API is in use we will disable the flash cache. */
 #if BSP_FEATURE_BSP_FLASH_CACHE_DISABLE_OPM
    R_BSP_FlashCacheDisable();
 #elif BSP_FEATURE_BSP_HAS_CODE_SYSTEM_CACHE

    /* Disable the C-Cache. */
    R_CACHE->CCACTL = 0U;
 #endif

    /* If interrupts are being used then disable interrupts. */
    if (p_ctrl->p_cfg->data_flash_bgo == true)
    {
        /* We are not supporting Flash Rdy interrupts for Code Flash operations */
        R_BSP_IrqDisable(p_ctrl->p_cfg->irq);

        /* We are not supporting Flash Err interrupts for Code Flash operations */
        R_BSP_IrqDisable(p_ctrl->p_cfg->err_irq);
    }

 #if BSP_FEATURE_FLASH_HP_HAS_FMEPROT
    R_FACI_HP->FMEPROT = FLASH_HP_FMEPROT_UNLOCK;
 #endif

    /* Enter code flash PE mode */
    R_FACI_HP->FENTRYR = FLASH_HP_FENTRYR_TRANSITION_TO_CF_PE;

    /* Wait for the operation to complete or timeout. If timeout return error. */
    /* Read FENTRYR until it has been set to 0x0001 indicating that we have successfully entered CF P/E mode.*/
    while (FLASH_HP_FENTRYR_CF_PE_MODE != R_FACI_HP->FENTRYR)
    {
        /* Wait until FENTRYR is 0x0001UL unless timeout occurs. */
        if (wait_count == 0U)
        {

            /* if FENTRYR is not set after max timeout, FSP_ERR_PE_FAILURE*/
            return FSP_ERR_PE_FAILURE;
        }

        wait_count--;
    }

    return err;
}

#endif
